app/controllers/authentication_controller.rb

INSERT INTO `users` (`username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('newuser', 'newuser@test.com', '$2a$04$n6KcgYdI0XAT0bed4b4EKeIitjlzxWLKxpTGEbWP75Bdoyqtn1OXC', '2025-08-02 14:18:52.198944', '2025-08-02 14:18:52.198944')
---
  def signup
    user = User.new(user_params)
    if user.save

SELECT `users`.* FROM `users` WHERE (email = 'laurette.roberts@lemke.example' OR username = 'laurette.roberts@lemke.example') LIMIT 1
---
  def login
    user = User.find_by("email = :identifier OR username = :identifier", identifier: params[:identifier])