app/controllers/notes_controller.rb

  def index
    notes = @current_user.notes
    notes = notes.where("title LIKE ? OR content LIKE ?", "%#{params[:q]}%", "%#{params[:q]}%") if params[:q].present?
---
SELECT `notes`.* FROM `notes` WHERE `notes`.`user_id` = 17

  def create
    note = @current_user.notes.new(note_params)
    if note.save
---
INSERT INTO `notes` (`title`, `content`, `user_id`, `tags`, `created_at`, `updated_at`) VALUES ('New Note', 'Some content here', 21, NULL, '2025-08-02 14:18:52.396258', '2025-08-02 14:18:52.396258')

  def update
    if @note.update(note_params)
---
UPDATE `notes` SET `notes`.`title` = 'Updated Title', `notes`.`updated_at` = '2025-08-02 14:18:52.471731' WHERE `notes`.`id` = 22

  def destroy
    @note.destroy
---
DELETE FROM `notes` WHERE `notes`.`id` = 33

  def set_note
    @note = @current_user.notes.find_by!(id: params[:id])
---
SELECT `notes`.* FROM `notes` WHERE `notes`.`user_id` = 29 AND `notes`.`id` = 33 LIMIT 1